Autodesk.Revit.DB.Electrical.CircuitNamingScheme.SetCombinedParameters(System.Collections.Generic.IList{Autodesk.Revit.DB.TableCellCombinedParameterData})
Sets combined parameters array.
Remarks:
Currently the following parameters are supported:
Project Parameters
Shared Parameters
RBS_ELEC_CIRCUIT_NAME
RBS_ELEC_CIRCUIT_PANEL_PARAM
RBS_ELEC_CIRCUIT_TYPE
CIRCUIT_LOAD_CLASSIFICATION_ABBREVIATION_PARAM
RBS_ELEC_CIRCUIT_NAMING_INDEX
RBS_ELEC_NUMBER_OF_POLES
RBS_ELEC_CIRCUIT_RATING_PARAM
RBS_ELEC_CIRCUIT_FRAME_PARAM
RBS_ELEC_VOLTAGE
CIRCUIT_PHASE_PARAM
CIRCUIT_WAYS_PARAM
RBS_ELEC_CIRCUIT_SLOT_INDEX
data:
The array of TableCellCombinedParameterData to be set as combined parameters.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The data contains invalid parameter id.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2021

Autodesk.Revit.DB.Electrical.CircuitNamingScheme.GetCombinedParameters
Gets the combined parameters.
Returns:
Gets array of TableCellCombinedParameterData with the combined parameters data.
Since:
2021

Autodesk.Revit.DB.Electrical.CircuitNamingScheme.IsNameUnique(Autodesk.Revit.DB.Document,System.String)
Validates whether the CircuitNamingScheme name is unique in document.
aDocument:
The document in which the name is being tested for uniqueness.
name:
The name tested for uniqueness.
Returns:
Returns true if the name is unique, and false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2021

Autodesk.Revit.DB.Electrical.CircuitNamingScheme.IsValidCombinedParameters(Autodesk.Revit.DB.Document,System.Collections.Generic.IList{Autodesk.Revit.DB.TableCellCombinedParameterData})
Validates whether the combined parameters is valid.
Remarks:
Currently the following parameters are supported:
Shared Parameters
RBS_ELEC_CIRCUIT_NAME
RBS_ELEC_CIRCUIT_PANEL_PARAM
RBS_ELEC_CIRCUIT_TYPE
CIRCUIT_LOAD_CLASSIFICATION_ABBREVIATION_PARAM
RBS_ELEC_CIRCUIT_NAMING_INDEX
RBS_ELEC_NUMBER_OF_POLES
RBS_ELEC_CIRCUIT_RATING_PARAM
RBS_ELEC_CIRCUIT_FRAME_PARAM
RBS_ELEC_VOLTAGE
CIRCUIT_PHASE_PARAM
CIRCUIT_WAYS_PARAM
RBS_ELEC_CIRCUIT_SLOT_INDEX
aDocument:
The document.
data:
The array of TableCellCombinedParameterData to be set as combined parameters.
Returns:
Returns true if the combined parameters are valid, and false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2021

Autodesk.Revit.DB.Electrical.CircuitNamingScheme.Create(Autodesk.Revit.DB.Document,System.String,System.Collections.Generic.IList{Autodesk.Revit.DB.TableCellCombinedParameterData})
Creates a new CircuitNamingScheme.
document:
The document in which to create the CircuitNamingScheme.
name:
The name of CircuitNamingScheme.
data:
The array of TableCellCombinedParameterData to be set as combined parameters.
Returns:
The newly created CircuitNamingScheme.
Throws Autodesk.Revit.Exceptions.ArgumentException:
name is an empty string or contains only whitespace.
-or-
name cannot include prohibited characters, such as "{, }, [, ], |, ;, less-than sign, greater-than sign, ?, `, ~".
-or-
The given value for name is already in use as a CircuitNamingScheme name.
-or-
The data contains invalid parameter id.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2021

Autodesk.Revit.DB.Electrical.CircuitNamingScheme
This class represents a circuit naming scheme in Autodesk Revit.
Since:
2021